ukw100/STECCY/src/sdcard/stm32_sdcard.h
/*-------------------------------------------------------------------------------------------------------------------------------------------
 * stm32_sdcard.h - definitions for SD card handler
 *-------------------------------------------------------------------------------------------------------------------------------------------
 * MIT License
 *
 * Copyright (c) 2019-2021 Frank Meyer - frank(at)fli4l.de
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#ifndef STM32F4_SDCARD_H
#define STM32F4_SDCARD_H

#include "stm32f4xx.h"
#include "diskio.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"
#include "misc.h"
#include "stm32f4xx_sdio.h"
#include "stm32f4xx_dma.h"

#define SDIO_STM32F4_REV        1                       //  0 = Revision A, 1 = Revision Z

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * SDIO mode
 *   1 = 4bit mode
 *    0 = 1bit mode
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define USE_SDIO_4BIT_MODE      1                       // use 4bit mode

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * SD card petect pin
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define   USE_DETECT_PIN        0                       // don't use detect pin

#if USE_DETECT_PIN==1
#  define SD_DETECT_PIN                     GPIO_Pin_0
#  define SD_DETECT_GPIO_PORT               GPIOC
#  define SD_DETECT_GPIO_CLK                RCC_AHB1Periph_GPIOC
#endif

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * FIFO address
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define SDIO_FIFO_ADDRESS                   ((uint32_t) 0x40012C80)

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * Init SD Clock (max 400kHz): f = 48MHz / (prescaler + 2) = 400 kHz
 * Transfer SD Clock:          f = 48MHz / (prescaler + 2) = 24MHz
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define SDIO_INIT_CLK_DIV                   ((uint8_t) 0x76)
#define SDIO_TRANSFER_CLK_DIV               ((uint8_t) 0x00)

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * DMA Settings
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define SD_SDIO_DMA                         DMA2
#define SD_SDIO_DMA_CLK                     RCC_AHB1Periph_DMA2

#define SD_SDIO_DMA_STREAM3                 3
//#define SD_SDIO_DMA_STREAM6               6

#ifdef SD_SDIO_DMA_STREAM3
#  define SD_SDIO_DMA_STREAM                DMA2_Stream3
#  define SD_SDIO_DMA_CHANNEL               DMA_Channel_4
#  define SD_SDIO_DMA_FLAG_FEIF             DMA_FLAG_FEIF3
#  define SD_SDIO_DMA_FLAG_DMEIF            DMA_FLAG_DMEIF3
#  define SD_SDIO_DMA_FLAG_TEIF             DMA_FLAG_TEIF3
#  define SD_SDIO_DMA_FLAG_HTIF             DMA_FLAG_HTIF3
#  define SD_SDIO_DMA_FLAG_TCIF             DMA_FLAG_TCIF3
#  define SD_SDIO_DMA_IRQn                  DMA2_Stream3_IRQn
#  define SD_SDIO_DMA_IRQHANDLER            DMA2_Stream3_IRQHandler
#elif defined SD_SDIO_DMA_STREAM6
#  define SD_SDIO_DMA_STREAM                DMA2_Stream6
#  define SD_SDIO_DMA_CHANNEL               DMA_Channel_4
#  define SD_SDIO_DMA_FLAG_FEIF             DMA_FLAG_FEIF6
#  define SD_SDIO_DMA_FLAG_DMEIF            DMA_FLAG_DMEIF6
#  define SD_SDIO_DMA_FLAG_TEIF             DMA_FLAG_TEIF6
#  define SD_SDIO_DMA_FLAG_HTIF             DMA_FLAG_HTIF6
#  define SD_SDIO_DMA_FLAG_TCIF             DMA_FLAG_TCIF6
#  define SD_SDIO_DMA_IRQn                  DMA2_Stream6_IRQn
#  define SD_SDIO_DMA_IRQHANDLER            DMA2_Stream6_IRQHandler
#endif /* SD_SDIO_DMA_STREAM3 */

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * polling mode or DMA mode
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#if !defined (SD_DMA_MODE) && !defined (SD_POLLING_MODE)
 #define SD_DMA_MODE                        ((uint32_t)0x00000000)
  //#define SD_POLLING_MODE                 ((uint32_t)0x00000002)
#endif

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * see also stm324xg_eval_sdio_sd.c
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#ifndef NULL                                // fm
#define NULL 0
#endif

#define SDIO_STATIC_FLAGS                   ((uint32_t)0x000005FF)
#define SDIO_CMD0TIMEOUT                    ((uint32_t)0x00010000)

