ukw100/STECCY/src/sdcard/stm32_sdcard.h
#define SD_OCR_ADDR_OUT_OF_RANGE            ((uint32_t)0x80000000)
#define SD_OCR_ADDR_MISALIGNED              ((uint32_t)0x40000000)
#define SD_OCR_BLOCK_LEN_ERR                ((uint32_t)0x20000000)
#define SD_OCR_ERASE_SEQ_ERR                ((uint32_t)0x10000000)
#define SD_OCR_BAD_ERASE_PARAM              ((uint32_t)0x08000000)
#define SD_OCR_WRITE_PROT_VIOLATION         ((uint32_t)0x04000000)
#define SD_OCR_LOCK_UNLOCK_FAILED           ((uint32_t)0x01000000)
#define SD_OCR_COM_CRC_FAILED               ((uint32_t)0x00800000)
#define SD_OCR_ILLEGAL_CMD                  ((uint32_t)0x00400000)
#define SD_OCR_CARD_ECC_FAILED              ((uint32_t)0x00200000)
#define SD_OCR_CC_ERROR                     ((uint32_t)0x00100000)
#define SD_OCR_GENERAL_UNKNOWN_ERROR        ((uint32_t)0x00080000)
#define SD_OCR_STREAM_READ_UNDERRUN         ((uint32_t)0x00040000)
#define SD_OCR_STREAM_WRITE_OVERRUN         ((uint32_t)0x00020000)
#define SD_OCR_CID_CSD_OVERWRIETE           ((uint32_t)0x00010000)
#define SD_OCR_WP_ERASE_SKIP                ((uint32_t)0x00008000)
#define SD_OCR_CARD_ECC_DISABLED            ((uint32_t)0x00004000)
#define SD_OCR_ERASE_RESET                  ((uint32_t)0x00002000)
#define SD_OCR_AKE_SEQ_ERROR                ((uint32_t)0x00000008)
#define SD_OCR_ERRORBITS                    ((uint32_t)0xFDFFE008)

#define SD_R6_GENERAL_UNKNOWN_ERROR         ((uint32_t)0x00002000)
#define SD_R6_ILLEGAL_CMD                   ((uint32_t)0x00004000)
#define SD_R6_COM_CRC_FAILED                ((uint32_t)0x00008000)

#define SD_VOLTAGE_WINDOW_SD                ((uint32_t)0x80100000)
#define SD_HIGH_CAPACITY                    ((uint32_t)0x40000000)
#define SD_STD_CAPACITY                     ((uint32_t)0x00000000)
#define SD_CHECK_PATTERN                    ((uint32_t)0x000001AA)

#define SD_MAX_VOLT_TRIAL                   ((uint32_t)0x0000FFFF)
#define SD_ALLZERO                          ((uint32_t)0x00000000)

#define SD_WIDE_BUS_SUPPORT                 ((uint32_t)0x00040000)
#define SD_SINGLE_BUS_SUPPORT               ((uint32_t)0x00010000)
#define SD_CARD_LOCKED                      ((uint32_t)0x02000000)

#define SD_DATATIMEOUT                      ((uint32_t)0xFFFFFFFF)
#define SD_0TO7BITS                         ((uint32_t)0x000000FF)
#define SD_8TO15BITS                        ((uint32_t)0x0000FF00)
#define SD_16TO23BITS                       ((uint32_t)0x00FF0000)
#define SD_24TO31BITS                       ((uint32_t)0xFF000000)
#define SD_MAX_DATA_LENGTH                  ((uint32_t)0x01FFFFFF)

#define SD_HALFFIFO                         ((uint32_t)0x00000008)
#define SD_HALFFIFOBYTES                    ((uint32_t)0x00000020)

#define SD_CCCC_LOCK_UNLOCK                 ((uint32_t)0x00000080)
#define SD_CCCC_WRITE_PROT                  ((uint32_t)0x00000040)
#define SD_CCCC_ERASE                       ((uint32_t)0x00000020)

#define SDIO_SEND_IF_COND                   ((uint32_t)0x00000008)

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * see also stm324xg_eval_sdio_sd.h
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
typedef enum
{
    SD_CMD_CRC_FAIL                    = (1), /*!< Command response received (but CRC check failed) */
    SD_DATA_CRC_FAIL                   = (2), /*!< Data bock sent/received (CRC check Failed) */
    SD_CMD_RSP_TIMEOUT                 = (3), /*!< Command response timeout */
    SD_DATA_TIMEOUT                    = (4), /*!< Data time out */
    SD_TX_UNDERRUN                     = (5), /*!< Transmit FIFO under-run */
    SD_RX_OVERRUN                      = (6), /*!< Receive FIFO over-run */
    SD_START_BIT_ERR                   = (7), /*!< Start bit not detected on all data signals in widE bus mode */
    SD_CMD_OUT_OF_RANGE                = (8), /*!< CMD's argument was out of range.*/
    SD_ADDR_MISALIGNED                 = (9), /*!< Misaligned address */
    SD_BLOCK_LEN_ERR                   = (10), /*!< Transferred block length is not allowed for the card or the number of transferred bytes does not match the block length */
    SD_ERASE_SEQ_ERR                   = (11), /*!< An error in the sequence of erase command occurs.*/
    SD_BAD_ERASE_PARAM                 = (12), /*!< An Invalid selection for erase groups */
    SD_WRITE_PROT_VIOLATION            = (13), /*!< Attempt to program a write protect block */
    SD_LOCK_UNLOCK_FAILED              = (14), /*!< Sequence or password error has been detected in unlock command or if there was an attempt to access a locked card */
    SD_COM_CRC_FAILED                  = (15), /*!< CRC check of the previous command failed */
    SD_ILLEGAL_CMD                     = (16), /*!< Command is not legal for the card state */
    SD_CARD_ECC_FAILED                 = (17), /*!< Card internal ECC was applied but failed to correct the data */
    SD_CC_ERROR                        = (18), /*!< Internal card controller error */
    SD_GENERAL_UNKNOWN_ERROR           = (19), /*!< General or Unknown error */
    SD_STREAM_READ_UNDERRUN            = (20), /*!< The card could not sustain data transfer in stream read operation. */
    SD_STREAM_WRITE_OVERRUN            = (21), /*!< The card could not sustain data programming in stream mode */
    SD_CID_CSD_OVERWRITE               = (22), /*!< CID/CSD overwrite error */
    SD_WP_ERASE_SKIP                   = (23), /*!< only partial address space was erased */
    SD_CARD_ECC_DISABLED               = (24), /*!< Command has been executed without using internal ECC */
    SD_ERASE_RESET                     = (25), /*!< Erase sequence was cleared before executing because an out of erase sequence command was received */
    SD_AKE_SEQ_ERROR                   = (26), /*!< Error in sequence of authentication. */
    SD_INVALID_VOLTRANGE               = (27),
    SD_ADDR_OUT_OF_RANGE               = (28),
    SD_SWITCH_ERROR                    = (29),
    SD_SDIO_DISABLED                   = (30),
    SD_SDIO_FUNCTION_BUSY              = (31),
    SD_SDIO_FUNCTION_FAILED            = (32),
    SD_SDIO_UNKNOWN_FUNCTION           = (33),
    SD_INTERNAL_ERROR,
    SD_NOT_CONFIGURED,
    SD_REQUEST_PENDING,
    SD_REQUEST_NOT_APPLICABLE,
    SD_INVALID_PARAMETER,
    SD_UNSUPPORTED_FEATURE,
    SD_UNSUPPORTED_HW,
    SD_ERROR,
    SD_OK = 0
} SD_Error;

