ukw100/STECCY/src/sdcard/stm32_sdcard.h
typedef enum
{
    SD_TRANSFER_OK  = 0,
    SD_TRANSFER_BUSY = 1,
    SD_TRANSFER_ERROR
} SDTransferState;

typedef enum
{
    SD_CARD_READY                  = ((uint32_t)0x00000001),
    SD_CARD_IDENTIFICATION         = ((uint32_t)0x00000002),
    SD_CARD_STANDBY                = ((uint32_t)0x00000003),
    SD_CARD_TRANSFER               = ((uint32_t)0x00000004),
    SD_CARD_SENDING                = ((uint32_t)0x00000005),
    SD_CARD_RECEIVING              = ((uint32_t)0x00000006),
    SD_CARD_PROGRAMMING            = ((uint32_t)0x00000007),
    SD_CARD_DISCONNECTED           = ((uint32_t)0x00000008),
    SD_CARD_ERROR                  = ((uint32_t)0x000000FF)
}SDCardState;


typedef struct
{
    volatile uint8_t  CSDStruct;            /*!< CSD structure */
    volatile uint8_t  SysSpecVersion;       /*!< System specification version */
    volatile uint8_t  Reserved1;            /*!< Reserved */
    volatile uint8_t  TAAC;                 /*!< Data read access-time 1 */
    volatile uint8_t  NSAC;                 /*!< Data read access-time 2 in CLK cycles */
    volatile uint8_t  MaxBusClkFrec;        /*!< Max. bus clock frequency */
    volatile uint16_t CardComdClasses;      /*!< Card command classes */
    volatile uint8_t  RdBlockLen;           /*!< Max. read data block length */
    volatile uint8_t  PartBlockRead;        /*!< Partial blocks for read allowed */
    volatile uint8_t  WrBlockMisalign;      /*!< Write block misalignment */
    volatile uint8_t  RdBlockMisalign;      /*!< Read block misalignment */
    volatile uint8_t  DSRImpl;              /*!< DSR implemented */
    volatile uint8_t  Reserved2;            /*!< Reserved */
    volatile uint32_t DeviceSize;           /*!< Device Size */
    volatile uint8_t  MaxRdCurrentVDDMin;   /*!< Max. read current @ VDD min */
    volatile uint8_t  MaxRdCurrentVDDMax;   /*!< Max. read current @ VDD max */
    volatile uint8_t  MaxWrCurrentVDDMin;   /*!< Max. write current @ VDD min */
    volatile uint8_t  MaxWrCurrentVDDMax;   /*!< Max. write current @ VDD max */
    volatile uint8_t  DeviceSizeMul;        /*!< Device size multiplier */
    volatile uint8_t  EraseGrSize;          /*!< Erase group size */
    volatile uint8_t  EraseGrMul;           /*!< Erase group size multiplier */
    volatile uint8_t  WrProtectGrSize;      /*!< Write protect group size */
    volatile uint8_t  WrProtectGrEnable;    /*!< Write protect group enable */
    volatile uint8_t  ManDeflECC;           /*!< Manufacturer default ECC */
    volatile uint8_t  WrSpeedFact;          /*!< Write speed factor */
    volatile uint8_t  MaxWrBlockLen;        /*!< Max. write data block length */
    volatile uint8_t  WriteBlockPaPartial;  /*!< Partial blocks for write allowed */
    volatile uint8_t  Reserved3;            /*!< Reserded */
    volatile uint8_t  ContentProtectAppli;  /*!< Content protection application */
    volatile uint8_t  FileFormatGrouop;     /*!< File format group */
    volatile uint8_t  CopyFlag;             /*!< Copy flag (OTP) */
    volatile uint8_t  PermWrProtect;        /*!< Permanent write protection */
    volatile uint8_t  TempWrProtect;        /*!< Temporary write protection */
    volatile uint8_t  FileFormat;           /*!< File Format */
    volatile uint8_t  ECC;                  /*!< ECC code */
    volatile uint8_t  CSD_CRC;              /*!< CSD CRC */
    volatile uint8_t  Reserved4;            /*!< always 1*/
} SD_CSD;

typedef struct
{
    volatile uint8_t  ManufacturerID;       /*!< ManufacturerID */
    volatile uint16_t OEM_AppliID;          /*!< OEM/Application ID */
    volatile uint32_t ProdName1;            /*!< Product Name part1 */
    volatile uint8_t  ProdName2;            /*!< Product Name part2*/
    volatile uint8_t  ProdRev;              /*!< Product Revision */
    volatile uint32_t ProdSN;               /*!< Product Serial Number */
    volatile uint8_t  Reserved1;            /*!< Reserved1 */
    volatile uint16_t ManufactDate;         /*!< Manufacturing Date */
    volatile uint8_t  CID_CRC;              /*!< CID CRC */
    volatile uint8_t  Reserved2;            /*!< always 1 */
} SD_CID;

typedef struct
{
    volatile uint8_t DAT_BUS_WIDTH;
    volatile uint8_t SECURED_MODE;
    volatile uint16_t SD_CARD_TYPE;
    volatile uint32_t SIZE_OF_PROTECTED_AREA;
    volatile uint8_t SPEED_CLASS;
    volatile uint8_t PERFORMANCE_MOVE;
    volatile uint8_t AU_SIZE;
    volatile uint16_t ERASE_SIZE;
    volatile uint8_t ERASE_TIMEOUT;
    volatile uint8_t ERASE_OFFSET;
} SD_CardStatus;

typedef struct
{
    SD_CSD      SD_csd;
    SD_CID      SD_cid;
    uint64_t    CardCapacity;  /*!< Card Capacity */
    uint32_t    CardBlockSize; /*!< Card Block Size */
    uint16_t    RCA;
    uint8_t     CardType;
} SD_CardInfo;


#define SD_CMD_GO_IDLE_STATE                       ((uint8_t)0)
#define SD_CMD_SEND_OP_COND                        ((uint8_t)1)
#define SD_CMD_ALL_SEND_CID                        ((uint8_t)2)
#define SD_CMD_SET_REL_ADDR                        ((uint8_t)3) /*!< SDIO_SEND_REL_ADDR for SD Card */
#define SD_CMD_SET_DSR                             ((uint8_t)4)
#define SD_CMD_SDIO_SEN_OP_COND                    ((uint8_t)5)
#define SD_CMD_HS_SWITCH                           ((uint8_t)6)
#define SD_CMD_SEL_DESEL_CARD                      ((uint8_t)7)
#define SD_CMD_HS_SEND_EXT_CSD                     ((uint8_t)8)
#define SD_CMD_SEND_CSD                            ((uint8_t)9)
#define SD_CMD_SEND_CID                            ((uint8_t)10)
#define SD_CMD_READ_DAT_UNTIL_STOP                 ((uint8_t)11) /*!< SD Card doesn't support it */
#define SD_CMD_STOP_TRANSMISSION                   ((uint8_t)12)
#define SD_CMD_SEND_STATUS                         ((uint8_t)13)
#define SD_CMD_HS_BUSTEST_READ                     ((uint8_t)14)
#define SD_CMD_GO_INACTIVE_STATE                   ((uint8_t)15)
#define SD_CMD_SET_BLOCKLEN                        ((uint8_t)16)
#define SD_CMD_READ_SINGLE_BLOCK                   ((uint8_t)17)
#define SD_CMD_READ_MULT_BLOCK                     ((uint8_t)18)
#define SD_CMD_HS_BUSTEST_WRITE                    ((uint8_t)19)
#define SD_CMD_WRITE_DAT_UNTIL_STOP                ((uint8_t)20) /*!< SD Card doesn't support it */
#define SD_CMD_SET_BLOCK_COUNT                     ((uint8_t)23) /*!< SD Card doesn't support it */
#define SD_CMD_WRITE_SINGLE_BLOCK                  ((uint8_t)24)
#define SD_CMD_WRITE_MULT_BLOCK                    ((uint8_t)25)
#define SD_CMD_PROG_CID                            ((uint8_t)26) /*!< reserved for manufacturers */
#define SD_CMD_PROG_CSD                            ((uint8_t)27)
#define SD_CMD_SET_WRITE_PROT                      ((uint8_t)28)
#define SD_CMD_CLR_WRITE_PROT                      ((uint8_t)29)
#define SD_CMD_SEND_WRITE_PROT                     ((uint8_t)30)
#define SD_CMD_SD_ERASE_GRP_START                  ((uint8_t)32) /*!< To set the address of the first write
                                                                  block to be erased. (For SD card only) */
#define SD_CMD_SD_ERASE_GRP_END                    ((uint8_t)33) /*!< To set the address of the last write block of the
                                                                  continuous range to be erased. (For SD card only) */
#define SD_CMD_ERASE_GRP_START                     ((uint8_t)35) /*!< To set the address of the first write block to be erased.
                                                                  (For MMC card only spec 3.31) */

#define SD_CMD_ERASE_GRP_END                       ((uint8_t)36) /*!< To set the address of the last write block of the
                                                                  continuous range to be erased. (For MMC card only spec 3.31) */

